<?php
/*
    
    Note:
    l_eXX: login error;

    r_sXX: register success;
    r_eXX: register error;

    p_sXX: post success;
    p_eXX: post error;

    c_sXX: comment success;
    c_eXX: comment error;
*/ 
$msg = [
    'l_e01' => "บัญชีหรือรหัสผ่านไม่ถูกต้อง",

    'r_s00' => "สมัครผู้ใช้งานใหม่เสร็จสิ้น",
    'r_e01' => "เกิดข้อผิดพลาดในการสมัคร",
    'r_e02' => "ชื่อผู้ใช้นี้มีผู้ใช้งานแล้ว",
    'r_e03' => "โปรดกรอกข้อมูลให้ครบถ้วน",
    'r_e04' => "โปรดกรอกรหัสผ่านให้ถูกต้อง",

    'p_s00' => "เกิดข้อผิดพลาดบางอย่างระหว่างส่งข้อมูล",
    'p_e01' => "กรุณากรอกข้อมูลให้ครบถ้วน",
    'p_e02' => "กรุณาทำการเข้าสู่ระบบก่อนส่งข้อมูล",

    'c_s00' => "ส่งข้อมูลเสร็จสิ้น",
    'c_e01' => "เกิดข้อผิดพลาดในการส่งข้อมูล",
    'c_e02' => "โปรดระบุข้อมูล",
    'c_e03' => "กรุณาเข้าสู่ระบบ",

    'c_s00' => "เพิ่มหมวดหมู่ใหม่เสร็จสิ้น",
    'c_e01' => "เกิดข้อผิดพลาดในการส่งข้อมูล"

];

?>